In [2]:
!pip install pandas

Requirement already satisfied: pandas in ./.venv/lib/python3.12/site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in ./.venv/lib/python3.12/site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in ./.venv/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in ./.venv/lib/python3.12/site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in ./.venv/lib/python3.12/site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in ./.venv/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [3]:
import pandas as pd
import numpy as np

In [10]:
## Playing with Dataframe

df=pd.DataFrame(np.arange(10,30).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5']
                ,columns=["Column1","Column2","Column3","Coumn4"])

In [11]:
df.head()

      Column1  Column2  Column3  Coumn4
Row1       10       11       12      13
Row2       14       15       16      17
Row3       18       19       20      21
Row4       22       23       24      25
Row5       26       27       28      29

In [12]:
df.loc['Row1']

Column1    10
Column2    11
Column3    12
Coumn4     13
Name: Row1, dtype: int64

In [13]:
type(df.loc['Row1'])

pandas.core.series.Series

In [14]:
df.iloc[:,:]

      Column1  Column2  Column3  Coumn4
Row1       10       11       12      13
Row2       14       15       16      17
Row3       18       19       20      21
Row4       22       23       24      25
Row5       26       27       28      29

In [15]:
df.iloc[:,1:].values

array([[11, 12, 13],
       [15, 16, 17],
       [19, 20, 21],
       [23, 24, 25],
       [27, 28, 29]])

In [16]:
df['Column1'].value_counts()

Column1
10    1
14    1
18    1
22    1
26    1
Name: count, dtype: int64

In [18]:
df=pd.read_csv('mercedesbenz.csv')

In [22]:
df.describe()

,ID,y,X10,X11,X12,X13,X14,X15,X16,X17,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
count,4209.000000,4209.000000,4209.000000,4209.0,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,...,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000
mean,4205.960798,100.669318,0.013305,0.0,0.075077,0.057971,0.428130,0.000475,0.002613,0.007603,...,0.318841,0.057258,0.314802,0.020670,0.009503,0.008078,0.007603,0.001663,0.000475,0.001426
std,2437.608688,12.679381,0.114590,0.0,0.263547,0.233716,0.494867,0.021796,0.051061,0.086872,...,0.466082,0.232363,0.464492,0.142294,0.097033,0.089524,0.086872,0.040752,0.021796,0.037734
min,0.000000,72.110000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2095.000000,90.820000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,4220.000000,99.150000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,6314.000000,109.010000,0.000000,0.0,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,...,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,8417.000000,265.320000,1.000000,0.0,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [23]:
#Get the unique category counts
df['X0'].value_counts()

X0
z     360
ak    349
y     324
ay    313
t     306
x     300
o     269
f     227
n     195
w     182
j     181
az    175
aj    151
s     106
ap    103
h      75
d      73
al     67
v      36
af     35
m      34
ai     34
e      32
ba     27
at     25
a      21
ax     19
aq     18
am     18
i      18
u      17
aw     16
l      16
ad     14
au     11
k      11
b      11
r      10
as     10
bc      6
ao      4
c       3
aa      2
q       2
ac      1
g       1
ab      1
Name: count, dtype: int64

In [24]:
df[df['y']>100]

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
6,24,128.76,al,r,e,f,d,f,h,s,...,0,0,0,0,0,0,0,0,0,0
8,27,108.67,w,s,as,e,d,f,i,h,...,1,0,0,0,0,0,0,0,0,0
9,30,126.99,j,b,aq,c,d,f,a,e,...,0,0,1,0,0,0,0,0,0,0
10,31,102.09,h,r,r,f,d,f,h,p,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4202,8402,123.34,ap,l,s,c,d,aa,d,r,...,0,0,0,0,0,0,0,0,0,0
4204,8405,107.39,ak,s,as,c,d,aa,d,q,...,1,0,0,0,0,0,0,0,0,0
4205,8406,108.77,j,o,t,d,d,aa,h,h,...,0,1,0,0,0,0,0,0,0,0
4206,8412,109.22,ak,v,r,a,d,aa,g,e,...,0,0,1,0,0,0,0,0,0,0
4208,8417,110.85,z,r,ae,c,d,aa,g,w,...,1,0,0,0,0,0,0,0,0,0

In [27]:
df['X11'].value_counts()

X11
0    4209
Name: count, dtype: int64

In [28]:
lst_data=[[1,2,3],[3,4,np.nan],[5,6,np.nan],[np.nan,np.nan,np.nan]]

In [29]:
df=pd.DataFrame(lst_data)

In [30]:
df.head()

     0    1    2
0  1.0  2.0  3.0
1  3.0  4.0  NaN
2  5.0  6.0  NaN
3  NaN  NaN  NaN

In [31]:
## HAndling Missing Values

##Drop nan values

df.dropna(axis=0)

     0    1    2
0  1.0  2.0  3.0

In [32]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [33]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f', 'h'],
                     columns=['one', 'two', 'three'])

In [34]:
df.head()

        one       two     three
a -0.161922 -0.230171  1.060789
c  0.270068 -0.003033 -0.227625
e  1.130232 -0.429730 -0.707913
f -0.297462  0.348147  0.559522
h  1.062669 -0.555941 -0.410984

In [35]:
df2=df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])

In [36]:
df2

        one       two     three
a -0.161922 -0.230171  1.060789
b       NaN       NaN       NaN
c  0.270068 -0.003033 -0.227625
d       NaN       NaN       NaN
e  1.130232 -0.429730 -0.707913
f -0.297462  0.348147  0.559522
g       NaN       NaN       NaN
h  1.062669 -0.555941 -0.410984

In [37]:
df2.dropna(axis=0)

        one       two     three
a -0.161922 -0.230171  1.060789
c  0.270068 -0.003033 -0.227625
e  1.130232 -0.429730 -0.707913
f -0.297462  0.348147  0.559522
h  1.062669 -0.555941 -0.410984

In [38]:
pd.isna(df2['one'])

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [39]:
df2['one'].notna()

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

In [40]:
df2.fillna('Missing')

        one       two     three
a -0.161922 -0.230171  1.060789
b   Missing   Missing   Missing
c  0.270068 -0.003033 -0.227625
d   Missing   Missing   Missing
e  1.130232  -0.42973 -0.707913
f -0.297462  0.348147  0.559522
g   Missing   Missing   Missing
h  1.062669 -0.555941 -0.410984

In [41]:
df2['one'].values

array([-0.16192227,         nan,  0.27006817,         nan,  1.13023188,
       -0.29746171,         nan,  1.06266944])